app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["commenter", "asdasd"], ["article_id", 1], ["created_at", "2016-02-29 18:11:55.829200"], ["updated_at", "2016-02-29 18:11:55.829200"]]